Revit 2027 API
BuiltInFailures.ConnectorFailures.ElementHasMultipleConnectors Property
 Revit found one or more elements with multiple connectors. Select each element and then select the connectors to use for the analytical connection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementHasMultipleConnectors { get; }
Public Shared ReadOnly Property ElementHasMultipleConnectors As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementHasMultipleConnectors {
	FailureDefinitionId^ get ();
}
static member ElementHasMultipleConnectors : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace